bookers2-debug/app/views/books/index.html.erb

                      <i><span class="glyphicon glyphicon-heart" aria-hidden="true"></span></i>
                      <%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

              <td>
                  <%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]