bookers2-debug/app/views/books/show.html.erb

                      <i><span class="glyphicon glyphicon-heart" aria-hidden="true"></span></i>
                      <%= @book.favorites.count %> いいね</th>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                      <i><span class="glyphicon glyphicon-heart-empty" aria-hidden="true"></span></i>
                      <%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]

                    <div class="float-wrapper">
                        <h3 class="comment-count"><%= @book.book_comments.count %>件コメント</h3>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

                    <ol>
                      <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]