bookers2-debug/app/views/users/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                      <i><span class="glyphicon glyphicon-heart" aria-hidden="true"></span></i>
                      <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
                      <i><span class="glyphicon glyphicon-heart-empty" aria-hidden="true"></span></i>
                      <%= book.favorites.count %>

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
                <td>
                  <%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %>