bookers2-debug/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "test"], ["user_id", 2], ["created_at", "2020-05-05 11:17:14.260747"], ["updated_at", "2020-05-05 11:17:14.260747"]]
---
  def create
  	@book = Book.new(book_params)
    @book.user_id = current_user.id #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
  	if @book.save #入力されたデータをdbに保存する。

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
  	book = Book.find(params[:id])