bookers2-debug/app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?)  [["user_id", 2], ["created_at", "2020-05-04 12:21:33.276475"], ["updated_at", "2020-05-04 12:21:33.276475"], ["book_id", 1]]
---
	def create
	    book = Book.find(params[:book_id])
	    favorite = current_user.favorites.new(book_id: book.id)
	    favorite.save