bookers2-debug/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", "f5e0e15db28b6975062f76fb21fae9558ad572e8bf443b7b064b6ead33b5"], ["updated_at", "2020-05-02 08:40:38.971286"], ["id", 2]]
---
  def update
    if current_user
       @user = User.find(params[:id])
       if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def followings
    @user = User.find(params[:id])